KERWINHUGH/woniu/code/stm32/250427/小车代码/250425_01_TIM1输出PWM/Hardware/PWM.c
#include "stm32f10x.h"                  // Device header
#include "PWM.h"



//使用定时器1，生成PWM波形
//TIM1，使用CH1--接在PA8上，CH2--接在PA9上，连接在TB6612（电机驱动芯片）的PWMA和PWM2上，
void PWM_Init(void)
{	
	//1.开始钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
//	//2.配置时钟来源
	TIM_InternalClockConfig(TIM1);
	//3.配置时基单元
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStruct.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStruct.TIM_Period = 7200-1;//ARR
	TIM_TimeBaseInitStruct.TIM_Prescaler = 1-1;//PSC	
	TIM_TimeBaseInitStruct.TIM_RepetitionCounter = 0x00;//配置重复次数计数
	TIM_TimeBaseInit(TIM1,&TIM_TimeBaseInitStruct);
	
//	//6.开启定时器
//	TIM_Cmd(TIM1,ENABLE);
	
//	//4.配置OC输出比较单元
	TIM_OCInitTypeDef TIM_OCInitStruct;
	TIM_OCStructInit(&TIM_OCInitStruct);
	TIM_OCInitStruct.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStruct.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStruct.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStruct.TIM_Pulse = 0;
	TIM_OC1Init(TIM1,&TIM_OCInitStruct);
	TIM_OC2Init(TIM1,&TIM_OCInitStruct);
//	//5.配置GPIO输出PWM引脚
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;//引脚输出模式配置为复用推挽
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStruct);
	
	//让TIM1高级定时器输出PWM
	TIM_CtrlPWMOutputs(TIM1,ENABLE);
	
	//6.开启定时器
	TIM_Cmd(TIM1,ENABLE);
//	
}



